# Looking for info about gross in data sets

In [1]:
# Import library
import pandas as pd

In [2]:
# Select database and first 10 rows
df2 = pd.read_csv('data/tn.movie_budgets.csv.gz', index_col=0)
df2.head(10)

,release_date,movie,production_budget,domestic_gross,worldwide_gross
id,,,,,
1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
6,"Dec 18, 2015",Star Wars Ep. VII: The Force Awakens,"$306,000,000","$936,662,225","$2,053,311,220"
7,"Apr 27, 2018",Avengers: Infinity War,"$300,000,000","$678,815,482","$2,048,134,200"
8,"May 24, 2007",Pirates of the Caribbean: At Worldâs End,"$300,000,000","$309,420,425","$963,420,425"
9,"Nov 17, 2017",Justice League,"$300,000,000","$229,024,295","$655,945,209"
10,"Nov 6, 2015",Spectre,"$300,000,000","$200,074,175","$879,620,923"

## Cleaning data step by step

In [3]:
# Deleting simbols
simbols=["$",","]
for simbol in simbols:
    df2["domestic_gross"]=df2["domestic_gross"].apply(lambda x: x.replace(simbol,""))

In [4]:
# Converting to int
df2["domestic_gross"]=pd.to_numeric(df2['domestic_gross'])

In [5]:
# Sorting data
df2['domestic_gross'].sort_values(ascending=False).head(10)

id
6     936662225
1     760507625
42    700059566
7     678815482
43    659363944
34    652270625
27    623279547
5     620181382
44    608581744
75    533720947
Name: domestic_gross, dtype: int64

## Cleaning data using a funtion

In [6]:
# function to clean column, Run again dataset
df2 = pd.read_csv('data/tn.movie_budgets.csv.gz', index_col=0)
def clean_order (column):
    column=column.apply(lambda x: x.replace(",","").replace("$",""))
    column=pd.to_numeric(column)
    column.sort_values(ascending=False).head(10)

In [7]:
clean_order(df2['domestic_gross'])

In [8]:
df2[['movie','domestic_gross','worldwide_gross']].sort_values(by='domestic_gross',ascending=False).head(10)

                           movie domestic_gross worldwide_gross
id
12  AstÃ©rix aux Jeux Olympiques       $999,811    $132,999,811
6              Gnomeo and Juliet    $99,967,670    $193,737,977
43             Christopher Robin    $99,215,042    $197,504,758
74                   Desert Blue        $99,147         $99,147
8                       Hercules    $99,112,101    $250,700,000
43              Twin Falls Idaho       $985,341      $1,027,228
9             Olympus Has Fallen    $98,927,592    $172,878,928
4                Heaven Can Wait    $98,800,000     $98,800,000
29              The Green Hornet    $98,780,042    $229,155,503
99                    Date Night    $98,711,404    $152,269,033

## Looking for useful data in other dataset

In [9]:
# Calling new dataset and Ten rows 
df_bom = pd.read_csv('data/bom.movie_gross.csv.gz', index_col=0)
df_bom.head(10)

,studio,domestic_gross,foreign_gross,year
title,,,,
Toy Story 3,BV,415000000.0,652000000,2010
Alice in Wonderland (2010),BV,334200000.0,691300000,2010
Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
Inception,WB,292600000.0,535700000,2010
Shrek Forever After,P/DW,238700000.0,513900000,2010
The Twilight Saga: Eclipse,Sum.,300500000.0,398000000,2010
Iron Man 2,Par.,312400000.0,311500000,2010
Tangled,BV,200800000.0,391000000,2010
Despicable Me,Uni.,251500000.0,291600000,2010
How to Train Your Dragon,P/DW,217600000.0,277300000,2010

In [10]:
# Getting information of dataset
df_bom.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3387 entries, Toy Story 3 to An Actor Prepares
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   studio          3382 non-null   object
 1   domestic_gross  3359 non-null   float64
 2   foreign_gross   2037 non-null   object
 3   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 132.3+ KB

In [11]:
# Getting Nan Values
df_bom.isna().sum()

studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [12]:
# Deleting Nan values of foreign_gross and domestic _gross
df_bom=df_bom.dropna(subset=['foreign_gross','domestic_gross'])

In [13]:
# Getting Nan Values
df_bom.isna().sum()

studio            2
domestic_gross    0
foreign_gross     0
year              0
dtype: int64

In [14]:
# Getting info if table without Nan values in foreign_gross and domestic _gross
df_bom.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2009 entries, Toy Story 3 to Antonio Lopez 1970: Sex Fashion & Disco
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   studio          2007 non-null   object
 1   domestic_gross  2009 non-null   float64
 2   foreign_gross   2009 non-null   object
 3   year            2009 non-null   int64
dtypes: float64(1), int64(1), object(2)
memory usage: 78.5+ KB

## We won't use this data set because has more than 1300 Nan values in gross_column. It's more than third part